In [2]:
import pandas as pd
import pymongo

In [3]:
df = pd.read_csv('Marks.csv')

In [41]:
df.head()

   student id              Name       Exam       Quiz   Homework
0           1        aimee Zank   1.463180  11.782733  35.874035
1           2  Aurelia Menendez  60.060451  52.797907  71.761334
2           3       Corliss Zuk  67.030771   6.301852  66.283447
3           4        Bao Ziglar  71.643439  24.802213  42.261471
4           5  Zachary Langlais  78.683851  90.296310  34.416201

In [4]:
df.tail()

     student id              Name       Exam       Quiz   Homework
195         195     Linnie Weigel  52.445784  90.777505  11.750084
196         196  Santiago Dollins  52.040526  33.633001  78.792574
197         197     Tonisha Games  38.512696  31.162876  79.158564
198         198    Timothy Harrod  11.907567  20.518800  64.856504
199         199        Rae Kohout  82.117426  49.612955  28.868237

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   student id  200 non-null    int64
 1   Name        199 non-null    object
 2   Exam        200 non-null    float64
 3   Quiz        200 non-null    float64
 4   Homework    200 non-null    float64
dtypes: float64(3), int64(1), object(1)
memory usage: 7.9+ KB

In [6]:
df.dtypes

student id      int64
Name           object
Exam          float64
Quiz          float64
Homework      float64
dtype: object

In [7]:
df.columns

Index(['student id', 'Name', 'Exam', 'Quiz', 'Homework'], dtype='object')

In [8]:
df.describe()

       student id        Exam        Quiz    Homework
count  200.000000  200.000000  200.000000  200.000000
mean   100.000000   48.673671   48.996723   67.818696
std     57.445626   28.494072   31.246695   22.465717
min      1.000000    0.043811    0.006247   11.750084
25%     50.750000   23.050956   22.197422   54.397653
50%    100.000000   45.941638   45.362527   71.883264
75%    149.250000   73.081578   79.474781   87.144048
max    199.000000   99.336858   99.803482   99.772377

In [9]:
df.shape

(200, 5)

In [10]:
df['Quiz']

0      11.782733
1      52.797907
2       6.301852
3      24.802213
4      90.296310
         ...
195    90.777505
196    33.633001
197    31.162876
198    20.518800
199    49.612955
Name: Quiz, Length: 200, dtype: float64

In [11]:
df['Quiz'].value_counts()

11.782733    1
65.503138    1
95.675637    1
14.981124    1
47.647767    1
            ..
99.803482    1
96.052286    1
5.247411     1
32.660222    1
49.612955    1
Name: Quiz, Length: 200, dtype: int64

In [14]:
df_group_by = df.groupby("Name")
df_group_by.ngroups

113

In [15]:
df_group_by.groups

{'Adrien Renda': [76, 190], 'Aleida Elsass': [41, 155], 'Alica Pasley': [50, 164], 'Alix Sherrill': [14, 128], 'Aurelia Menendez': [1, 115], 'Bao Ziglar': [3, 117], 'Barbera Lippman': [48, 162], 'Beckie Millington': [107], 'Brain Lachapelle': [86], 'Brittny Warwick': [104], 'Carli Belvins': [34, 148], 'Carli Ector': [98], 'Cassi Heal': [89], 'Chad Rahe': [57, 171], 'Cody Strouth': [69, 183], 'Corliss Zuk': [2, 116], 'Danika Loeffler': [56, 170], 'Daphne Zheng': [8, 122], 'Darby Wass': [94], 'Demarcus Audette': [100], 'Denisha Cast': [10, 124], 'Devorah Smartt': [73, 187], 'Dinah Sauve': [49, 163], 'Dodie Staller': [16, 130], 'Dusti Lemmond': [60, 174], 'Echo Pippins': [80, 194], 'Edgar Sarkis': [27, 141], 'Efrain Claw': [77, 191], 'Elizabet Kleine': [51, 165], 'Ernestine Macfarland': [43, 157], 'Eugene Magdaleno': [36, 150], 'Fleta Duplantis': [103], 'Fletcher Mcconnell': [17, 131], 'Flora Duell': [109], 'Gena Riccio': [65, 179], 'Gennie Ratner': [111], 'Gisela Levin': [19, 133], 'Grady Zemke': [61, 175], 'Gwen Honig': [32, 146], 'Gwyneth Garling': [29, 143], 'Harriett Velarde': [70, 184], 'Houston Valenti': [44, 158], 'Jaclyn Morado': [99], 'Jenette Flanders': [6, 120], 'Jenise Mcguffie': [68, 182], 'Jessika Dagenais': [13, 127], 'Jesusa Rickenbacker': [24, 138], 'Joaquina Arbuckle': [58, 172], 'Joel Rueter': [54, 168], 'Jonie Raby': [26, 140], 'Kaila Deibler': [30, 144], 'Kam Senters': [71, 185], 'Karry Petrarca': [106], 'Kayce Kenyon': [42, 156], 'Keesha Papadopoulos': [88], 'Kim Xu': [66, 180], 'Kurtis Jiles': [47, 161], 'Lady Lefevers': [46, 160], 'Laureen Salomone': [28, 142], 'Len Treiber': [78, 192], 'Leola Lundin': [74, 188], 'Leonida Lafond': [72, 186], 'Linnie Weigel': [81, 195], 'Lucinda Vanderburg': [93], 'Malisa Jeanes': [53, 167], 'Marcus Blohm': [11, 125], 'Maren Scheider': [97], 'Margart Vitello': [22, 136], 'Mariela Sherer': [79, 193], 'Mariette Batdorf': [39, 153], 'Meagan Oakes': [37, 151], 'Mercedez Garduno': [102], 'Merissa Mann': [67, 181], 'Mikaela Meidinger': [108], 'Milan Mcgavock': [96], 'Myrtle Wolfinger': [112], 'Nobuko Linzey': [110], 'Omar Bowdoin': [95], 'Osvaldo Hirt': [90], 'Quincy Danaher': [12, 126], 'Rachell Aman': [40, 154], 'Rae Kohout': [85, 199], 'Richelle Siemers': [38, 152], 'Rosana Vales': [21, 135], 'Rubie Winton': [63, 177], 'Rudolph Domingo': [25, 139], 'Sadie Jernigan': [33, 147], 'Salena Olmos': [7, 121], 'Sanda Ryba': [9, 123], 'Santiago Dollins': [82, 196], 'Shin Allbright': [105], 'Synthia Labelle': [35, 149], 'Ta Sikorski': [92], 'Tambra Mercure': [15, 129], 'Tamika Schildgen': [23, 137], 'Tandra Meadows': [31, 145], 'Tania Hulett': [101], 'Tawana Oberg': [52, 166], 'Terica Brugger': [45, 159], 'Timothy Harrod': [84, 198], ...}

In [17]:
df_group_by.size()

Name
Adrien Renda        2
Aleida Elsass       2
Alica Pasley        2
Alix Sherrill       2
Aurelia Menendez    2
                   ..
Vinnie Auerbach     2
Whitley Fears       2
Wilburn Spiess      2
Zachary Langlais    2
aimee Zank          2
Length: 113, dtype: int64

In [18]:
df_group_by.first()

                  student id       Exam       Quiz   Homework
Name
Adrien Renda              77  57.247949  19.511823  70.710434
Aleida Elsass             42  28.025180  95.252431  68.059804
Alica Pasley              51  19.385447  88.707527  60.627552
Alix Sherrill             15  25.159242  68.644840  24.684622
Aurelia Menendez           2  60.060451  52.797907  71.761334
...                      ...        ...        ...        ...
Vinnie Auerbach           60  95.455083   7.512188  28.590575
Whitley Fears             65  89.618458  82.448792  96.579121
Wilburn Spiess             6  44.871863  25.723951  63.422883
Zachary Langlais           5  78.683851  90.296310  34.416201
aimee Zank                 1   1.463180  11.782733  35.874035

[113 rows x 4 columns]

In [1]:
#higheshest mark 
{"_id":{"$oid":"622b0dc6d4d2028de2dafe27"},"student id":"14","Name":"Jessika Dagenais","Exam":90.47179954,"Quiz":90.30014025,"Homework":95.17753772,"Total":275.9494775}

{'_id': {'$oid': '622b0dc6d4d2028de2dafe27'},
 'student id': '14',
 'Name': 'Jessika Dagenais',
 'Exam': 90.47179954,
 'Quiz': 90.30014025,
 'Homework': 95.17753772,
 'Total': 275.9494775}